app/controllers/music_page_controller.rb

SELECT * FROM "musics" ORDER BY title
SELECT * FROM "musics" WHERE ("musics"."id" IN (2,3,4))
---
  def filter_music_by_category
  	name = params[:filter_column]
        value = "%"+params[:filter_value]+"%"
#	puts "name = #{name}, value = "#{value}"
	if value.empty?
 		@filtered_list = Music.find_music_for_store
 	else
# 		@filtered_list = Music.find_by_sql("select * from musics where #{value} like '%#{name}%'")
		@filtered_list = Music.find(:all,:conditions=>["#{name} like ?",value])

SELECT * FROM "musics" ORDER BY title
---
  def display
  	session[:music] ||= Music.find_music_for_store

SELECT * FROM "musics" WHERE ("musics"."id" = 2)
---
  def add_previewed_music_to_list
  	selected = Music.find(params[:id])

INSERT INTO "play_lists" ("updated_at", "username", "playlist_title", "music_id", "created_at") VALUES('2010-09-10 08:43:26', 'acave', 'new playlist', 3, '2010-09-10 08:43:26')
---
  def save_playlist
  	@selected_list = find_selectedlist
  	@playlist = PlayList.new(params[:playlist])
  	@playlist.add_songs_from_selected_list(@selected_list)
  	if @playlist.save