app/controllers/music_page_controller.rb

  def index
  	session[:music] = Music.find_music_for_store
---
SELECT * FROM "musics" ORDER BY title