app/controllers/musics_controller.rb

SELECT * FROM "musics"
---
  def index
    @musics = Music.all

SELECT * FROM "musics" WHERE ("musics"."id" = 900526198)
---
  def show
    @music = Music.find(params[:id])

SELECT * FROM "musics" WHERE ("musics"."id" = 900526198)
---
  def edit
    @music = Music.find(params[:id])

INSERT INTO "musics" ("updated_at", "title", "description", "song", "created_at") VALUES('2010-07-20 02:11:32', 'Sunburn', 'This is the newest release to the new hit group "Owl City". This young, aspiring song writer is an active Christian who happens to be an insomniac amazingly has some addictive songs with clean lyrics and some catchy techno songs', '/songs/Sunburn.m4a', '2010-07-20 02:11:32')
---
  def create
    @music = Music.new(params[:music])

    respond_to do |format|
      if @music.save

SELECT * FROM "musics" WHERE ("musics"."id" = 2)
---
  def get_playlists_for_song
    	@music = Music.find(params[:id])

SELECT * FROM "musics" WHERE ("musics"."id" = 900526198)
UPDATE "musics" SET "description" = 'This is a hit song from Owl city!', "updated_at" = '2010-07-25 04:51:00' WHERE "id" = 2
---
  def update
    @music = Music.find(params[:id])

    respond_to do |format|
      if @music.update_attributes(params[:music])

SELECT * FROM "musics" WHERE ("musics"."id" = 900526198)
DELETE FROM "musics" WHERE "id" = 900526198
---
  def destroy
    @music = Music.find(params[:id])
    @music.destroy