app/controllers/play_lists_controller.rb

  def index
    @play_lists = PlayList.all
---
SELECT * FROM "play_lists"

  def show
    @play_list = PlayList.find(params[:id])
---
SELECT * FROM "play_lists" WHERE ("play_lists"."id" = 980190962)

  def edit
    @play_list = PlayList.find(params[:id])
---
SELECT * FROM "play_lists" WHERE ("play_lists"."id" = 980190962)

  def create
    @play_list = PlayList.new(params[:play_list])

    respond_to do |format|
      if @play_list.save
---
INSERT INTO "play_lists" ("updated_at", "username", "playlist_title", "created_at") VALUES('2010-09-24 04:38:33', 'Cavenator', 'Unit Test', '2010-09-24 04:38:33')

  def update
    @play_list = PlayList.find(params[:id])
---
SELECT * FROM "play_lists" WHERE ("play_lists"."id" = 980190962)

  def destroy
    @play_list = PlayList.find(params[:id])
    @play_list.destroy
---
SELECT * FROM "play_lists" WHERE ("play_lists"."id" = 980190962)
DELETE FROM "play_lists" WHERE "id" = 980190962