app/controllers/song_lists_controller.rb

  def index
    @song_lists = SongList.all
---
SELECT * FROM "song_lists"

  def show
    @song_list = SongList.find(params[:id])
---
SELECT * FROM "song_lists" WHERE ("song_lists"."id" = 980190962)

  def edit
    @song_list = SongList.find(params[:id])
---
SELECT * FROM "song_lists" WHERE ("song_lists"."id" = 980190962)

  def create
    @song_list = SongList.new(params[:song_list])

    respond_to do |format|
      if @song_list.save
---
INSERT INTO "song_lists" ("updated_at", "music_id", "play_list_id", "created_at") VALUES('2010-09-24 04:40:34', 3, 1, '2010-09-24 04:40:34')

  def update
    @song_list = SongList.find(params[:id])
---
SELECT * FROM "song_lists" WHERE ("song_lists"."id" = 980190962)

  def destroy
    @song_list = SongList.find(params[:id])
    @song_list.destroy
---
SELECT * FROM "song_lists" WHERE ("song_lists"."id" = 980190962)
DELETE FROM "song_lists" WHERE "id" = 980190962